{
  "status": "ok",
  "totalResults": 1364,
  "articles": [
    {
      "source": { "id": null, "name": "Entrepreneur" },
      "author": "Entrepreneur Store",
      "title": "Find the Best Long-Tail Keywords for Your Web Pages",
      "description": "LongTailPro helps you give your SEO a boost.",
      "url": "https://www.entrepreneur.com/article/433628",
      "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/1660765286-Ent-LongTailPro.jpeg",
      "publishedAt": "2022-08-22T15:30:00Z",
      "content": "Digital marketing is an essential component of any online business. But it's also often expensive, with no guarantee on a return on your investment. Even the best, most experienced marketers can stru… [+1824 chars]"
    },
    {
      "source": { "id": null, "name": "ReadWrite" },
      "author": "Lucas Vitale",
      "title": "On-Page SEO Checklist for Beginners",
      "description": "Following this On-Page SEO Checklist helped us quickly reach 100,000 visitors per month on an affiliate website with 30% informational content and 70% commercial content. It’s important to take care of your On-Page SEO to rank higher in Google and other searc…",
      "url": "https://readwrite.com/on-page-seo-checklist-for-beginners/",
      "urlToImage": "https://images.readwrite.com/wp-content/uploads/2022/06/On-Page-SEO-Checklist.jpg",
      "publishedAt": "2022-08-07T17:25:20Z",
      "content": "Following this On-Page SEO Checklist helped us quickly reach 100,000 visitors per month on an affiliate website with 30% informational content and 70% commercial content.\r\nIt’s important to take care… [+12362 chars]"
    },
    {
      "source": { "id": null, "name": "Moz.com" },
      "author": "Tom Capper",
      "title": "How to Do Better, Lazier Keyword Research",
      "description": "In this post, Tom expands on one of the points from his recent MozCon talk: that a lot of time spent on keyword research is wasted. He’ll go over the three main ways SEOs turn what should be an involved piece of strategic thinking into an overly time-consumin…",
      "url": "https://moz.com/blog/how-to-do-better-keyword-research",
      "urlToImage": "https://moz.com/images/blog/banners/5dc9caebf37959.27892016_2021-04-16-000810.jpg?w=1200&h=630&q=82&auto=format&fit=crop&dm=1618531690&s=29dc9eb8387965c44e014c43a3311bca",
      "publishedAt": "2022-09-05T07:00:00Z",
      "content": "The author's views are entirely his or her own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz.This post is an expansion on something I discussed in my talk at … [+5898 chars]"
    },
    {
      "source": { "id": null, "name": "heise online" },
      "author": "Ben Schwan",
      "title": "Keyword-Spamming in Apples App Store ein wachsendes Problem",
      "description": "Selbst große Unternehmen betreiben SEO, um besser gefunden zu werden. Das nutzt dem Algorithmus, aber weniger dem User.",
      "url": "https://www.heise.de/news/Keyword-Spamming-im-App-Store-zunehmend-ein-Problem-7215545.html",
      "urlToImage": "https://heise.cloudimg.io/bound/1200x1200/q85.png-lossy-85.webp-lossy-85.foil1/_www-heise-de_/imgs/18/3/5/8/9/6/0/0/shutterstock_1081604945-21aa0e5c2f260e93.jpg",
      "publishedAt": "2022-08-12T08:37:00Z",
      "content": "Ist Dropbox eine \"Cloud Photo Transfer\"-App? Wenn man der aktuellen Titelgebung in Apples iOS App Store glaubt, ist dem so denn das Unternehmen selbst bezeichnet seine Software auf diese Weise. Dass … [+2269 chars]"
    },
    {
      "source": { "id": null, "name": "Entrepreneur" },
      "author": "Adam Petrilli",
      "title": "It's a Trap! Watch Out for These Common Advertising Mistakes",
      "description": "Simple mistakes can significantly damage your advertising strategy, hurting your reach and budget. Avoiding these common traps can help sharpen ad performance and maximize your approach.",
      "url": "https://www.entrepreneur.com/article/432234",
      "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/1659963933-GettyImages-1037263522.jpg",
      "publishedAt": "2022-08-10T19:30:00Z",
      "content": "With most shopping happening on the Internet, online advertising has become crucial to any successful business. Google Ads can generate immense traffic to your product if done correctly. Whether you'… [+4846 chars]"
    },
    {
      "source": { "id": null, "name": "Yahoo Entertainment" },
      "author": "Ivan Mehta",
      "title": "Google is suing Sonos over patent infringement once again - Yahoo Movies Canada",
      "description": "<ol><li>Google is suing Sonos over patent infringement once again  Yahoo Movies Canada\r\n</li><li>Google sues Sonos over smart speaker and voice control tech  The Verge\r\n</li><li>Google again sues Sonos for copying smart speaker, voice control tech  Business S…",
      "url": "https://ca.movies.yahoo.com/google-suing-sonos-over-patent-121314738.html",
      "urlToImage": "https://s.yimg.com/ny/api/res/1.2/EV8XoM64Ly6AkbvW75u50A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/7VlEq7BtpzD.1sSB3o4dVQ--~B/aD0xMzM0O3c9MjAwMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/techcrunch_350/6610b19b91bda650f0de455e63759dcd",
      "publishedAt": "2022-08-08T12:13:14Z",
      "content": "Google is suing Sonos (again) over patent infringement in what seems to be an unending legal fight series between two tech companies. The two new lawsuits filed Monday center around various patents i… [+2399 chars]"
    },
    {
      "source": { "id": null, "name": "9to5Mac" },
      "author": "Ben Lovejoy",
      "title": "The names of many iOS apps are changing as even big brands engage in keyword spamming",
      "description": "The effectiveness of keyword spamming on the App Store is leading developers of many apps to change the names of their apps – including those owned by major brands … Apple commentator John Gruber noticed the trend, and was puzzled by it. Last week I noticed a…",
      "url": "https://9to5mac.com/2022/08/08/keyword-spamming/",
      "urlToImage": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/08/Keyword-spamming.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
      "publishedAt": "2022-08-08T14:05:31Z",
      "content": "The effectiveness of keyword spamming on the App Store is leading developers of many apps to change the names of their apps including those owned by major brands …\r\nApple commentator John Gruber noti… [+3144 chars]"
    },
    {
      "source": { "id": null, "name": "ReadWrite" },
      "author": "Nate Nead",
      "title": "SEO in Personal Injury Law: Improving Search Rankings in One of the Web’s Most Competitive Niches",
      "description": "Word of mouth referrals used to be the best way to gain new clients as a lawyer. But over the last decade, millions of people have turned to the internet to find the legal counsel they need. Part of being a lawyer is finding ways to market yourself online. SE…",
      "url": "https://readwrite.com/seo-in-personal-injury-law/",
      "urlToImage": "https://images.readwrite.com/wp-content/uploads/2020/07/How-Legal-Tech-Companies-Are-Re-Shaping-the-Legal-World.jpg",
      "publishedAt": "2022-08-10T14:35:43Z",
      "content": "Word of mouth referrals used to be the best way to gain new clients as a lawyer.\r\nBut over the last decade, millions of people have turned to the internet to find the legal counsel they need.\r\nPart o… [+6000 chars]"
    },
    {
      "source": { "id": "reuters", "name": "Reuters" },
      "author": "Reuters Fact Check",
      "title": "Fact Check-Claims that the Smithsonian destroyed 'thousands of giant skeletons' are many years old and satirical - Reuters",
      "description": "Claims that the Smithsonian Institution admitted destroying “thousands of giant skeletons” in the early 1900s originated on a website that identifies its content as “satirical” and “fictional.” Although the claim has been debunked since 2014, some social medi…",
      "url": "https://www.reuters.com/article/factcheck-skeletons-smithsonian-idUSL1N2ZG1I0",
      "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
      "publishedAt": "2022-08-04T15:16:00Z",
      "content": "Claims that the Smithsonian Institution admitted destroying thousands of giant skeletons in the early 1900s originated on a website that identifies its content as satirical and fictional. Although th… [+2553 chars]"
    },
    {
      "source": { "id": "reuters", "name": "Reuters" },
      "author": "Reuters Fact Check",
      "title": "Fact Check-Screenshot of fabricated CBC News article on Trudeau and climate change - Reuters.com",
      "description": "Social media users have shared a fabricated screenshot claiming to show a headline published by Canadian outlet CBC News which reports that Canada’s Prime Minister Justin Trudeau said climate change is “partially to blame for increasing hatred being cast at p…",
      "url": "https://www.reuters.com/article/factcheck-cbcnews-trudeau-idUSL1N30826K",
      "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
      "publishedAt": "2022-09-01T18:11:00Z",
      "content": "Social media users have shared a fabricated screenshot claiming to show a headline published by Canadian outlet CBC News which reports that Canadas Prime Minister Justin Trudeau said climate change i… [+2112 chars]"
    },
    {
      "source": { "id": null, "name": "The Guardian" },
      "author": "Brian Logan",
      "title": "Snort review – Rose Matafeo mucks in with merry improv team",
      "description": "Pleasance Courtyard, EdinburghA gang of New Zealand comics and their very special guests become Elvis impersonators, hobbits and chimney sweeps in a fun fringe nightGreat was the excitement on the festival’s opening weekend when Phoebe Waller-Bridge – the go-…",
      "url": "https://amp.theguardian.com/stage/2022/aug/15/snort-review-rose-matafeo-mucks-in-with-merry-improv-team",
      "urlToImage": "https://i.guim.co.uk/img/media/585ea53046dc55b9168379cd26813c2a3ef134ff/0_316_2000_1199/master/2000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTMucG5n&enable=upscale&s=e56b193f5a9e8325c8650d055d419f64",
      "publishedAt": "2022-08-15T12:22:53Z",
      "content": "Great was the excitement on the festivals opening weekend when Phoebe Waller-Bridge the go-to recent example of a fringe-made megastar photo oppd her way around town. But theres another Edinburgh suc… [+1956 chars]"
    },
    {
      "source": { "id": null, "name": "Quicksprout.com" },
      "author": "Lars Lofgren",
      "title": "Compare the Best Free SEO Tools",
      "description": "Want to jump straight to the answer? The best free SEO tool for most people is WooRank or CanIRank. An SEO strategy is an integral part of running an online business. If you want to improve your rank in search, find the best keywords for content, or receive d…",
      "url": "https://www.quicksprout.com/best-free-seo-tools/",
      "urlToImage": null,
      "publishedAt": "2022-08-07T22:00:00Z",
      "content": "Want to jump straight to the answer? The best free SEO tool for most people is WooRank or CanIRank.\r\nAn SEO strategy is an integral part of running an online business. If you want to improve your ran… [+12217 chars]"
    },
    {
      "source": { "id": null, "name": "Neilpatel.com" },
      "author": "Neil Patel",
      "title": "Content Optimization: A Step-by-Step Guide",
      "description": "Is your content not getting the results it deserves? Unfortunately, in today’s ultra-competitive, crowded SERPs, creating great content isn’t enough. You need to optimize it effectively if you want it to rank and sell. That doesn’t just mean optimizing conten…",
      "url": "https://neilpatel.com/blog/how-to-optimize-content/",
      "urlToImage": "https://neilpatel.com/wp-content/uploads/2022/08/Content_Optmization1.png",
      "publishedAt": "2022-08-26T19:00:00Z",
      "content": "Is your content not getting the results it deserves?\r\nUnfortunately, in todays ultra-competitive, crowded SERPs, creating great content isnt enough. You need to optimize it effectively if you want it… [+14771 chars]"
    },
    {
      "source": { "id": null, "name": "Entrepreneur" },
      "author": "Dr. Michael Dattoli",
      "title": "7 Tips for Reaching More Patients and Growing Your Healthcare Practice",
      "description": "Growing a medical practice takes more than a good bedside manner. To reach more patients and hit your goals, a strong business mindset is essential.",
      "url": "https://www.entrepreneur.com/article/432675",
      "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/1661282719-GettyImages-1219507073.jpg",
      "publishedAt": "2022-08-30T17:00:00Z",
      "content": "As doctors, we spend years in school and specialized training in our chosen field. We may go to work in hospitals. We might join established medical practices. We could choose to start our own practi… [+5815 chars]"
    },
    {
      "source": { "id": "reuters", "name": "Reuters" },
      "author": "Reuters Fact Check",
      "title": "Fact Check-Screenshot of an alleged WEF tweet about bug-based diets is fabricated - Reuters",
      "description": "A fabricated screenshot purporting to show a tweet by the World Economic Forum that says being against an insect-based diet is bigotry is circulating on social media.",
      "url": "https://www.reuters.com/article/factcheck-wef-bugs-idUSL1N3071W6",
      "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
      "publishedAt": "2022-08-31T17:25:00Z",
      "content": "A fabricated screenshot purporting to show a tweet by the World Economic Forum that says being against an insect-based diet is bigotry is circulating on social media.\r\nThe purported tweet is made to … [+2449 chars]"
    },
    {
      "source": { "id": "reuters", "name": "Reuters" },
      "author": "Reuters Fact Check",
      "title": "Fact Check-CBC News did not publish a headline on fines for making eye contact with officials - Reuters.com",
      "description": "An image purportedly showing a CBC News headline reporting on thousand-dollar fines proposed by the Liberal party in Canada “for making eye contact” with officials is fabricated.",
      "url": "https://www.reuters.com/article/factcheck-cbcnews-fines-idUSL1N3091CM",
      "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
      "publishedAt": "2022-09-02T15:02:00Z",
      "content": "An image purportedly showing a CBC News headline reporting on thousand-dollar fines proposed by the Liberal party in Canada for making eye contact with officials is fabricated.\r\nLiberals propose five… [+2764 chars]"
    },
    {
      "source": { "id": "reuters", "name": "Reuters" },
      "author": "Reuters Fact Check",
      "title": "Fact Check-Video about Ted Cruz makes unsubstantiated claims and includes unrelated Senate and House hearing clips - Reuters",
      "description": "There is no evidence that U.S. Republican Senator Ted Cruz released a document from “Hunter Biden’s laptop” that implicates U.S. House Speaker Nancy Pelosi, contrary to claims made alongside a video posted to social media.",
      "url": "https://www.reuters.com/article/factcheck-cruz-pelosi-idUSL1N2ZO19I",
      "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800",
      "publishedAt": "2022-08-12T14:32:00Z",
      "content": "There is no evidence that U.S. Republican Senator Ted Cruz released a document from Hunter Bidens laptop that implicates U.S. House Speaker Nancy Pelosi, contrary to claims made alongside a video pos… [+3730 chars]"
    },
    {
      "source": { "id": null, "name": "Quicksprout.com" },
      "author": "Lars Lofgren",
      "title": "Compare the Best Rank Tracking Tools",
      "description": "Want to jump straight to the answer? The best rank tracking tool for the majority of users will be Semrush or SE Ranking. For website owners, search ranking results are everything. You need to know whether your search engine optimization (SEO) strategies are …",
      "url": "https://www.quicksprout.com/best-rank-tracking-tools/",
      "urlToImage": null,
      "publishedAt": "2022-08-16T16:00:00Z",
      "content": "Want to jump straight to the answer? The best rank tracking tool for the majority of users will be Semrush or SE Ranking.\r\nFor website owners, search ranking results are everything. You need to know … [+13418 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Kaitie Frank",
      "title": "Why You Should Target Zero Search Volume Keywords via @sejournal, @KaitlynnFrank",
      "description": "Zero volume keywords can have a major impact on your traffic. Read on to learn the benefits and how to use them to your advantage.\nThe post Why You Should Target Zero Search Volume Keywords appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/why-you-should-target-zero-search-volume-keywords/458522/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/07/zero-volume-keywords-62daa6fc0e1ba-sej.png",
      "publishedAt": "2022-08-05T12:45:00Z",
      "content": "Many online businesses ignore keywords with zero search volume because they think no one is searching for that term.\r\nWhile it may be true that there is minimal search volume, online businesses in sa… [+10743 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Adam Riemer",
      "title": "How Can We Solve Autogenerated URL Errors Once & For All? via @sejournal, @rollerblader",
      "description": "Avoid cannibalizing your own pages and start making your pages official with canonical links and site mapping.\nThe post How Can We Solve Autogenerated URL Errors Once & For All? appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/autogenerated-url-errors/447144/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/04/autogenerated-url-errors-62dfdd0adfd6b-sej.png",
      "publishedAt": "2022-08-04T13:45:30Z",
      "content": "Today’s “Ask An SEO” question comes from Bhaumik from Mumbai, who asks:\r\n“I have a question about automatically generated URLs. My firm had previously used different tools to generate sitemaps. But r… [+3802 chars]"
    },
    {
      "source": { "id": null, "name": "Neilpatel.com" },
      "author": "Neil Patel",
      "title": "The Ultimate SEO Checklist for 2022",
      "description": "Does this topic sound a bit familiar? There’s a good reason for that. Every year, there are new SEO trends every website owner should be aware of. Sometimes it might just be a fresh approach to a classic SEO tactic, and other times, it’s something new that co…",
      "url": "https://neilpatel.com/blog/seo-checklist/",
      "urlToImage": "https://neilpatel.com/wp-content/uploads/2022/08/SEO-Checklist-1.jpg",
      "publishedAt": "2022-08-28T19:00:00Z",
      "content": "Does this topic sound a bit familiar? Theres a good reason for that.\r\nEvery year, there are new SEO trends every website owner should be aware of. Sometimes it might just be a fresh approach to a cla… [+24313 chars]"
    },
    {
      "source": { "id": null, "name": "Moz.com" },
      "author": "Éléonore Frère",
      "title": "Going International: 15 SEO Steps for a Successful Expansion",
      "description": "Making the decision to expand to a foreign market is a challenging undertaking. Each market has its own specificities in terms of language and culture, different from your local market. This article will guide you through the different SEO processes needed in…",
      "url": "https://moz.com/blog/15-seo-steps-for-international-expansion",
      "urlToImage": "https://moz.com/images/blog/banners/international-3cab245_2021-03-11-222440.jpg?w=1200&h=630&q=82&auto=format&fit=crop&dm=1615501480&s=8594f73604ef134b13b372d389332611",
      "publishedAt": "2022-08-08T07:00:00Z",
      "content": "The author's views are entirely his or her own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz.\r\nIntroduction\r\nExpanding your business internationally is an exc… [+20816 chars]"
    },
    {
      "source": { "id": null, "name": "Forbes" },
      "author": "YEC, Forbes Councils Member, \n YEC, Forbes Councils Member\n https://www.forbes.com/sites/theyec/",
      "title": "What To Look For In Your Enterprise SEO Manager",
      "description": "Did someone say “well-rounded?” Well, your SEO manager should be exactly that.",
      "url": "https://www.forbes.com/sites/theyec/2022/08/09/what-to-look-for-in-your-enterprise-seo-manager/",
      "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/5f9998a130fe443a6ee3328a/0x0.jpg?format=jpg&width=1200",
      "publishedAt": "2022-08-09T11:00:00Z",
      "content": "By Kristopher B. Jones, serial entrepreneur and investor. Kris is the Founder of 2020 SEO Agency of the Year Finalist LSEO.com.\r\ngetty\r\nAre you looking to hire an SEO expert for your company or organ… [+5924 chars]"
    },
    {
      "source": { "id": null, "name": "MakeUseOf" },
      "author": "Ukeje Chukwuemeriwo Goodness",
      "title": "Everything You Need to Know to Start Writing Bash Programs",
      "description": "You can use Bash scripts to automate all sorts of tasks. Get to grips with the fundamentals and begin your Bash scripting journey.",
      "url": "https://www.makeuseof.com/bash-programs-everything-writing/",
      "urlToImage": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2022/08/photo-of-a-command-line-interface-.jpg",
      "publishedAt": "2022-08-15T16:00:14Z",
      "content": "Bash scripts come in handy for automating tasks, and you’ll find they’re great for building simple command line applications. The Bash shell interprets Bash scripts, so you won’t need to install any … [+6381 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Amy Hebdon",
      "title": "Build A Brilliant Google Ads Audience-First Strategy (Even If You Don’t Want To) via @sejournal, @amyppc",
      "description": "Learn how (and why) to create a Google Ads audience-first strategy, and get started with demand generation.\nThe post Build A Brilliant Google Ads Audience-First Strategy (Even If You Don’t Want To) appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/build-a-brilliant-google-ads-audience-first-strategy-even-if-you-dont-want-to/458185/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/07/shutterstock_632400932-62de902408155-sej.png",
      "publishedAt": "2022-08-05T12:04:15Z",
      "content": "If you’ve been working with Google Ads/AdWords for a while, you know that it’s great for targeting intent.\r\nBy serving ads against keyword searches, you can promote your product or service to someone… [+7903 chars]"
    },
    {
      "source": { "id": null, "name": "Forbes" },
      "author": "John Hall, Senior Contributor, \n John Hall, Senior Contributor\n https://www.forbes.com/sites/johnhall/",
      "title": "How To Generate Better Results With These 4 Marketing Strategies",
      "description": "As traditional marketing shifts to growth marketing, you can’t simply rely on advertising. Authenticity and customization is key. Utilizing influencers, optimizing for local SEO, and personalizing your reviews and customer experiences can help you generate be…",
      "url": "https://www.forbes.com/sites/johnhall/2022/08/19/how-to-generate-better-results-with-these-4-marketing-strategies/",
      "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/616f031ae034e7cc41252b6e/0x0.jpg?format=jpg&crop=1550,1163,x0,y0,safe&width=1200",
      "publishedAt": "2022-08-19T22:00:31Z",
      "content": "Two people working together on laptop\r\ngetty\r\nConventional marketing wisdom implies customers will flock to a businesss doors if it advertises its products and services. But as any marketer soon find… [+5932 chars]"
    },
    {
      "source": { "id": null, "name": "Hackaday" },
      "author": "Al Williams",
      "title": "AI Creates Your Spreadsheets, Sometimes",
      "description": "We’ve been interested in looking at how AI can process things other than silly images. That’s why the “Free AI Bot that Generates the Excel Formula for Any Problem” caught …read more",
      "url": "https://hackaday.com/2022/08/09/ai-creates-your-spreadsheets-sometimes/",
      "urlToImage": "https://hackaday.com/wp-content/uploads/2022/08/ExcelAI.jpg",
      "publishedAt": "2022-08-09T14:00:52Z",
      "content": "We’ve been interested in looking at how AI can process things other than silly images. That’s why the “Free AI Bot that Generates the Excel Formula for Any Problem” caught our eye. Based on GPT-3, it… [+3060 chars]"
    },
    {
      "source": { "id": "the-verge", "name": "The Verge" },
      "author": "Adi Robertson",
      "title": "Professional AI whisperers have launched a marketplace for DALL-E prompts",
      "description": "An interview with a prompt engineer for PromptBase, a marketplace for selling DALL-E, Midjourney, and GPT-3 text prompts to generate AI art.",
      "url": "https://www.theverge.com/2022/9/2/23326868/dalle-midjourney-ai-promptbase-prompt-market-sales-artist-interview",
      "urlToImage": "https://cdn.vox-cdn.com/thumbor/p_R6PD2bCA-Qa0xGCfOiV4atPTs=/0x40:2048x1112/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23991474/thedextriarchy_fractal_robot_particle_dynamics_splattering_spra_e52840dc_6b2e_4209_bea4_b2cfa87e8b58.png",
      "publishedAt": "2022-09-02T14:30:00Z",
      "content": "A Verge-generated application of a Midjourney prompt for “futuristic succulents.”\r\n\n \n\n\n AI art isn’t just an experiment — it’s a side hustle In the past few years, art made by programs like Midjourn… [+11591 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Adam Heitzman",
      "title": "What Is Data Visualization And How To Use It For SEO via @sejournal, @AdamHeitzman",
      "description": "Learn the importance of data visualizing and how to use it for your SEO campaign.\nThe post What Is Data Visualization And How To Use It For SEO appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/data-visualization-for-seo/419288/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2021/09/data-visualization-1600-x-840-62eb47fec2ae7-sej.png",
      "publishedAt": "2022-08-19T11:45:41Z",
      "content": "Planning and executing an excellent SEO strategy is critical for any digital marketing campaign.\r\nHowever, the effort requires data to tell the story in a way that resonates with our clients.\r\nBut po… [+7016 chars]"
    },
    {
      "source": { "id": null, "name": "Windows Central" },
      "author": "Mauro Huculak",
      "title": "How to add tags to files on Windows 11",
      "description": "In this guide, we'll show you the steps to use tags to make it easier to group and find files on Windows 11.",
      "url": "https://www.windowscentral.com/software-apps/windows-11/how-to-add-tags-to-files-on-windows-11",
      "urlToImage": "https://cdn.mos.cms.futurecdn.net/WsbjjjQtyiX4YVf96RszDj-1200-80.jpg",
      "publishedAt": "2022-08-12T11:00:28Z",
      "content": "On Windows 11, the search feature allows you to quickly find virtually any type of file stored on your computer. However, if you have a lot of documents and pictures, you can use tags to make it easi… [+5037 chars]"
    },
    {
      "source": { "id": null, "name": "Small Business Trends" },
      "author": "Yednekachew Samson",
      "title": "SEO Courses",
      "description": "With the right SEO courses, you will be able to learn how to better optimize the content of your website or blog to grow your business.",
      "url": "https://smallbiztrends.com/2022/08/seo-courses.html",
      "urlToImage": "https://media.smallbiztrends.com/2022/08/seo-courses.png",
      "publishedAt": "2022-08-31T14:30:04Z",
      "content": "If you buy something through our links, we may earn money from our affiliate partners. Learn more.\r\nSearch engine optimization is a process for boosting the quality and quantity of traffic to your we… [+8729 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "SEOmonitor",
      "title": "How To Impress Your Leadership Team & Shareholders: Forecast SEO Performance via @sejournal, @seomonitor",
      "description": "Learn how to predict SEO trends & implement SEO forecasting to create the ultimate SEO strategy that convinces leadership to get on board.\nThe post How To Impress Your Leadership Team & Shareholders: Forecast SEO Performance appeared first on Search Engine Jo…",
      "url": "https://www.searchenginejournal.com/forecast-seo-impress-leadership-seomonitor-spcs/461755/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/08/featured-image-6304ec900133b-sej-e1661514774595.png",
      "publishedAt": "2022-08-30T05:00:12Z",
      "content": "Attract Potential Clients With A Clear Road To SEO Success\r\nSet yourself or your agency apart from competitors by having a detailed SEO forecast in place for any new business pitch.\r\nComing to the ta… [+4390 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Tony Wright",
      "title": "How SEO & Graphic Design Can Become A Dream Team via @sejournal, @tonynwright",
      "description": "Not sure how to reconcile design and SEO differences? Let the two work together for a better website experience for your user with these tips.\nThe post How SEO & Graphic Design Can Become A Dream Team appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/how-seo-graphic-design-can-become-a-dream-team/459499/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/07/seo-tips-for-graphic-designers-62e7b36077b68-sej.png",
      "publishedAt": "2022-08-09T12:45:50Z",
      "content": "SEO pros and graphic designers don’t always see eye to eye – and that’s a shame.\r\nModern graphic designers often prefer clean designs with lots of white space, whereas SEO professionals are less conc… [+5532 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Navah Hopkins",
      "title": "Why Is My New Campaign/Ad Group Getting No Traffic? via @sejournal, @navahf",
      "description": "When your new ad campaign is getting zero clicks, don't give up just yet. See the 5 most common problems and how to fix them. \nThe post Why Is My New Campaign/Ad Group Getting No Traffic? appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/new-campaign-ad-group-no-traffic/460109/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2020/02/navah-5e4196b1de534.jpg",
      "publishedAt": "2022-08-24T12:45:02Z",
      "content": "Managing paid search and paid social requires plenty of strategic shifts.\r\nOne of the biggest is understanding that paid search favors older entities while paid social favors new things.\r\nThat said, … [+4240 chars]"
    },
    {
      "source": { "id": "hacker-news", "name": "Hacker News" },
      "author": null,
      "title": "Tell HN: Most DisplayPort cables aren't sold with correct information",
      "description": "Comments",
      "url": "https://news.ycombinator.com/item?id=32627484",
      "urlToImage": null,
      "publishedAt": "2022-08-28T11:24:15Z",
      "content": "In every DisplayPort (DP) cable I've seen on Amazon and many other retailers, the main difference between cables is shown as the version of the DP specification that they support.Unfortunately, that'… [+1763 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Wilson Lau",
      "title": "Why Brand Awareness Is The Fifth Pillar Of SEO",
      "description": "In this article, you'll learn about why SEO marketers should consider brand awareness as the fifth pillar of SEO.\nThe post Why Brand Awareness Is The Fifth Pillar Of SEO appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/why-brand-awareness-is-the-fifth-pillar-of-seo/461435/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/08/brand-awareness-62fceda43a95a-sej.png",
      "publishedAt": "2022-08-24T13:45:41Z",
      "content": "Search engine optimization (SEO) is a marketing practice for increasing a website’s organic traffic through search engines.\r\nIt consists of techniques in four key areas: keyword and content, technica… [+12488 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Land" },
      "author": "Adam Tanguay",
      "title": "How to approach SEO in a period of global disruption",
      "description": "A good SEO strategy reflects people's needs – especially in a turbulent global landscape. Here's how to get traction with your pivots.\nThe post How to approach SEO in a period of global disruption appeared first on Search Engine Land.",
      "url": "https://searchengineland.com/seo-during-global-disruption-387218",
      "urlToImage": "https://searchengineland.com/wp-content/seloads/2022/08/How-to-approach-SEO-in-a-period-of-global-disruption.jpeg",
      "publishedAt": "2022-08-18T12:00:00Z",
      "content": "Marred by a pandemic, a war, political division, and seesawing economies, the past two-plus years have disrupted life as we know it. \r\nIf all these have taught us anything in the world of SEO, it’s t… [+7010 chars]"
    },
    {
      "source": { "id": null, "name": "Arduino.cc" },
      "author": "Arduino Team",
      "title": "Controlling a bionic hand with tinyML keyword spotting",
      "description": "Traditional methods of sending movement commands to prosthetic devices often include electromyography (reading electrical signals from muscles) or simple Bluetooth modules. But in this project, Ex Machina has developed an alternative strategy that enables use…",
      "url": "https://blog.arduino.cc/2022/08/31/controlling-a-bionic-hand-with-tinyml-keyword-spotting/",
      "urlToImage": "https://blog.arduino.cc/wp-content/uploads/2022/08/Bionic.png",
      "publishedAt": "2022-08-31T21:45:27Z",
      "content": "Traditional methods of sending movement commands to prosthetic devices often include electromyography (reading electrical signals from muscles) or simple Bluetooth modules. But in this project, Ex Ma… [+1384 chars]"
    },
    {
      "source": { "id": null, "name": "Entrepreneur" },
      "author": "Kenneth Burke",
      "title": "6 Questions to Create Your First Marketing Strategy",
      "description": "You've got something great to share with the world, but how do you get customers to pay for it? Start here.",
      "url": "https://www.entrepreneur.com/article/431280",
      "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/1659468126-GettyImages-1143029484.jpg",
      "publishedAt": "2022-08-08T18:30:00Z",
      "content": "Marketing can be complex, with dozens of campaigns across numerous channels feeding your bigger strategy. But it should be simple at first. In fact, a mistake I often see from startups and entreprene… [+5416 chars]"
    },
    {
      "source": { "id": "business-insider", "name": "Business Insider" },
      "author": "insider@insider.com (Parisa Hashempour)",
      "title": "Why Singapore still loves crypto",
      "description": "A new survey from the advertising firm BBH found one in three Singaporean respondents invested in crypto. And 65% of those investors plan on staying.",
      "url": "https://www.businessinsider.com/crypto-investing-in-singapore-new-research-from-bbh-2022-8",
      "urlToImage": "https://i.insider.com/62e43b544b455800188b6f40?width=1200&format=jpeg",
      "publishedAt": "2022-08-10T15:37:42Z",
      "content": "<ul><li></li></ul>Despite feeling the bite of the crypto winter, Singaporean investors remain steadfast in their optimism about cryptocurrency's future, or so suggests a large survey conducted by the… [+5062 chars]"
    },
    {
      "source": { "id": null, "name": "Entrepreneur" },
      "author": "Jessica Wong",
      "title": "Blockchain Will Change Your Marketing Strategy. Here's How.",
      "description": "Blockchain technology has the potential to trigger a new era of digital marketing accountability that will revolutionize the industry.",
      "url": "https://www.entrepreneur.com/article/433245",
      "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/1660914393-GettyImages-1324734533.jpg",
      "publishedAt": "2022-08-23T17:30:00Z",
      "content": "Blockchain and cryptocurrency have become buzzwords far beyond the worlds of digital marketing and technology. Experts predict the blockchain market will grow to nearly $40 million by 2025. But while… [+6124 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Roger Montti",
      "title": "Why You Should Use Boolean Search Operators For SEO via @sejournal, @martinibuster",
      "description": "The Boolean search logic offers a powerful way to extract specific and helpful SEO information.\nThe post Why You Should Use Boolean Search Operators For SEO appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/how-to-use-boolean-search-operators-seo-application/7822/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/07/shutterstock_2024167007-62dc6c9722c44-sej.jpg",
      "publishedAt": "2022-08-18T23:45:20Z",
      "content": "The Boolean search comprises a specific group of search operators that relate to the logic inherent in the words And, Or, and Not.\r\nAlthough they are three simple words, their effect on search result… [+7519 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Roger Montti",
      "title": "Why You Should Use Boolean Search Operators For SEO via @sejournal, @martinibuster",
      "description": "The Boolean search logic offers a powerful way to extract specific and helpful SEO information.\nThe post Why You Should Use Boolean Search Operators For SEO appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/boolean-search-operators-seo/458764/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/07/shutterstock_2024167007-62dc6c9722c44-sej.jpg",
      "publishedAt": "2022-08-09T11:45:15Z",
      "content": "The Boolean search comprises a specific group of search operators that relate to the logic inherent in the words And, Or, and Not.\r\nAlthough they are three simple words, their effect on search result… [+7519 chars]"
    },
    {
      "source": { "id": null, "name": "Lifehacker.ru" },
      "author": "Алексей Хромов",
      "title": "Вы точно уже видели этот сюжет. Почему «Дневную смену» стоит смотреть только ради экшена и Снуп Догга",
      "description": "«Дневная смена» — это неплохой фильм 2022 года, чтобы просто отдохнуть и ни о чём не думать. Но сюжет точно покажется вам знакомым.",
      "url": "https://lifehacker.ru/dnevnaya-smena-film-2022/",
      "urlToImage": "https://cdn.lifehacker.ru/wp-content/uploads/2022/08/DS_UNIT_008_1660307795-1280x640.jpg",
      "publishedAt": "2022-08-12T17:00:17Z",
      "content": ", , , «». , .\r\n 80 90 ? . 2022 . Netflix . . . 12  « » , .\r\n , .\r\n « » \r\n ( ) . , . , . , . . , .\r\n . , IMDb Sort by Popularity Most Popular Movies and TV Shows tagged with keyword «vampirehunter» 91… [+356 chars]"
    },
    {
      "source": { "id": null, "name": "Android Police" },
      "author": "Jules Wang",
      "title": "Android 13 is coming to phones from Samsung, Sony, Motorola, OnePlus, Oppo, Xiaomi, and more later this year",
      "description": "Coming soon to a phone near you (if not your phone)",
      "url": "https://www.androidpolice.com/android-13-first-wave-oems/",
      "urlToImage": "https://static1.anpoimages.com/wordpress/wp-content/uploads/2022/08/android-13-random-ap-hero.jpg",
      "publishedAt": "2022-08-15T17:00:14Z",
      "content": "The news is out: Android 13 is finally here and we didn't have to wait until September to get it! But for those of you who don't own a Pixel, when can you expect to get that fresh over-the-air softwa… [+1751 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Semrush",
      "title": "The Ultimate SEO Checklist For Boosting Organic Traffic: 6 Highlights via @sejournal, @semrush",
      "description": "Find out what's inside of Semrush's complete, top-to-bottom SEO checklist featuring 44 best practices along with helpful tool reminders.\nThe post The Ultimate SEO Checklist For Boosting Organic Traffic: 6 Highlights appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/seo-checklist-organic-traffic-semrush-spcs/461972/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/08/featured-image-copy-62ffcd6c2edba-sej.jpg",
      "publishedAt": "2022-08-29T05:00:38Z",
      "content": "Refine Your SEO Strategy\r\nOnce you’ve established your keywords, it’s time to refine your strategy:\r\n<ul><li>Create a keyword map.</li><li>Analyze the intent of pages that rank.</li><li>Identify ques… [+7055 chars]"
    },
    {
      "source": { "id": null, "name": "Lightroomkillertips.com" },
      "author": "Rob Sylvan",
      "title": "Finding People in Lightroom Classic: Part 2",
      "description": "Following up from last week’s post on using People view, let’s wrap things up. I’m a Blueberry As LrC indexes what it thinks are faces there will absolutely be some complete fails at recognizing a human face. Apparently, it thinks I resemble a blueberry! You’…",
      "url": "https://lightroomkillertips.com/finding-people-in-lightroom-classic-part-2/",
      "urlToImage": "https://lightroomkillertips.com/wp-content/uploads/2022/08/people2-02.jpg",
      "publishedAt": "2022-08-10T17:12:38Z",
      "content": "Following up from last week’s post on using People view, let’s wrap things up.\r\nIm a Blueberry\r\nAs LrC indexes what it thinks are faces there will absolutely be some complete fails at recognizing a h… [+2891 chars]"
    },
    {
      "source": { "id": null, "name": "MakeUseOf" },
      "author": "Mary Gathoni",
      "title": "How to Style React Components Using CSS Modules",
      "description": "Split your monolithic CSS code into small, reusable pieces with the help of CSS modules.",
      "url": "https://www.makeuseof.com/react-components-css-modules-style/",
      "urlToImage": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2022/08/pexels-negative-space-160107.jpg",
      "publishedAt": "2022-08-07T12:00:14Z",
      "content": "CSS modules provide a way to locally scope CSS class names. You don’t have to worry about overriding styles when you use the same class name.\r\nFind out how CSS modules work, why you should use them, … [+6057 chars]"
    },
    {
      "source": { "id": null, "name": "MakeUseOf" },
      "author": "Jack Slater",
      "title": "How to Enable Quick Action Commands in Firefox and Edge",
      "description": "Firefox and Edge both offer Quick Action commands in the address bar, but the option is hidden by default. Here's how to enable the feature.",
      "url": "https://www.makeuseof.com/enable-quick-action-commands-firefox-edge/",
      "urlToImage": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2022/08/laptop-keyboard-and-web-browser-1.jpg",
      "publishedAt": "2022-08-31T21:00:14Z",
      "content": "Google’s flagship browser has a Chrome Actions feature that enables its users to trigger browser actions by entering certain commands in the URL bar. Those action commands provide handy shortcuts for… [+4246 chars]"
    },
    {
      "source": { "id": null, "name": "Phandroid - News for Android" },
      "author": "Tyler Lee",
      "title": "Pixel owners will soon be able to silence calls with voice commands",
      "description": "In a future update, Google Pixel owners will be able to answer or silence incoming calls by using their voice.\nThe post Pixel owners will soon be able to silence calls with voice commands first appeared on Phandroid.",
      "url": "https://phandroid.com/2022/08/31/pixel-owners-will-soon-be-able-to-silence-calls-with-voice-commands/",
      "urlToImage": "https://phandroid.com/wp-content/uploads/2022/07/pixel-6-2-640x427.jpg",
      "publishedAt": "2022-09-01T02:28:55Z",
      "content": "To prevent accidental triggers, digital assistants like Google Assistant have a trigger phrase. This is to let the assistant know that they are being called. While this is a good implementation, it c… [+1139 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Heather Campbell",
      "title": "Boost Organic & Paid Traffic: How To Bring Your SEO & SEM Teams Together [Webinar] via @sejournal, @hethr_campbell",
      "description": "Learn the strategies and benefits of aligning paid and organic efforts to maximize your marketing team's ROI.\nThe post Boost Organic & Paid Traffic: How To Bring Your SEO & SEM Teams Together [Webinar] appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/bring-seo-sem-together-webinar/461590/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/08/featured-3-62fb9bf18b36d-sej.jpg",
      "publishedAt": "2022-09-02T20:00:11Z",
      "content": "Which team are you on, SEO or SEM?\r\nDo you feel like everyone is in this together, or does it seem like there are some independent islands where everyone is just thinking about themselves?\r\nUsually, … [+1199 chars]"
    },
    {
      "source": { "id": null, "name": "Practical Ecommerce" },
      "author": "Ann Smarty",
      "title": "6 Keyword Tools for Video SEO",
      "description": "The intent of consumers searching for videos often differs from searches of other content types. Ecommerce merchants should optimize for both. We explain.\nThe post 6 Keyword Tools for Video SEO appeared first on Practical Ecommerce.",
      "url": "https://www.practicalecommerce.com/6-keyword-tools-for-video-seo",
      "urlToImage": "https://www.practicalecommerce.com/wp-content/uploads/2022/08/6-Keyword-Tools-for-Video-SEO.jpg",
      "publishedAt": "2022-08-04T14:14:51Z",
      "content": "Keyword research for search engine optimization identifies the queries of a target audience. The process is similar for all forms of content, including videos.\r\nKnowing searchers’ keywords for findin… [+4274 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Emily Amor",
      "title": "14 Stellar SEO-Friendly Shopify Store Examples For Inspiration via @sejournal, @digital_darts",
      "description": "Be inspired by these 14 Shopify stores using SEO-friendly elements to optimize their stores and attract more organic traffic and sales.\nThe post 14 Stellar SEO-Friendly Shopify Store Examples For Inspiration appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/seo-friendly-shopify-store-examples/460465/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/08/seo-friendly-shopify-store-examples-62f12edee8173-sej.png",
      "publishedAt": "2022-08-17T13:45:45Z",
      "content": "To run a successful Shopify store, a thorough understanding of SEO is essential.\r\nA well-planned and executed SEO strategy has endless possibilities for generating your Shopify store’s organic traffi… [+12642 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Roger Montti",
      "title": "17 SEO Best Practices For Better Ranking via @sejournal, @martinibuster",
      "description": "Discover best practices for SEO, including some that may be new or challenge established ideas. Read advice straight from various CMS experts and more.\nThe post 17 SEO Best Practices For Better Ranking appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/17-seo-best-practices-for-better-ranking/459592/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/07/shutterstock_377261680-62e704f76e62c-sej.jpg",
      "publishedAt": "2022-08-04T12:45:44Z",
      "content": "There are many best practices for SEO, including those provided by Google.\r\nHere are 17 tips that can help one develop a better search presence.\r\nWhat Do Best Practices For SEO Even Mean?\r\nBest pract… [+36765 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Brooke Osmundson",
      "title": "4 Reasons Click Volume Decreases & What To Do via @sejournal, @brookeosmundson",
      "description": "Can't explain a sudden dip in click performance? Here are some of the common reasons to help identify the cause.\nThe post 4 Reasons Click Volume Decreases & What To Do appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/click-volume-decrease-solution/459726/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/08/click-volume-1600-x-840-62ece14aad490-sej.png",
      "publishedAt": "2022-08-26T11:45:55Z",
      "content": "You’ve noticed a drop in search volume. Is there a reason to be alarmed? Yes. You could be missing out on potential business opportunities.\r\nEvery click your business misses out on means that your co… [+7317 chars]"
    },
    {
      "source": { "id": null, "name": "Cliki.net" },
      "author": null,
      "title": "Common Lisp Wiki: Naming Conventions",
      "description": "Comments",
      "url": "https://www.cliki.net/naming+conventions",
      "urlToImage": null,
      "publishedAt": "2022-08-28T14:48:37Z",
      "content": "Some symbol naming conventions, distilled from CLHS, the Lisp FAQ, and comp.lang.lisp.Widely used \"need-to-know\" conventions:\r\n<table><tr><td>foo-bar</td><td>\"-\" is used as a word delimiter</td></tr>… [+6153 chars]"
    },
    {
      "source": { "id": null, "name": "Impress.co.jp" },
      "author": null,
      "title": "グーグル、「Google 検索」における品質向上の取り組みとは",
      "description": "グーグル（Google）は、同社の公式ブログ「The Keyword」で、「Google 検索」の品質向上に向けた取り組みを紹介している。",
      "url": "https://k-tai.watch.impress.co.jp/docs/news/1432186.html",
      "urlToImage": "https://k-tai.watch.impress.co.jp/img/ktw/list/1432/186/01.jpg",
      "publishedAt": "2022-08-15T06:00:56Z",
      "content": "Google AIMultitask Unified ModelMUM \r\n WebAI \r\n AI \r\n 40"
    },
    {
      "source": { "id": null, "name": "Impress.co.jp" },
      "author": null,
      "title": "グーグルがChromeの「タップして検索」の活用法を4つ紹介、次の新機能も紹介",
      "description": "グーグル（Google）は、同社の公式ブログである「The Keyword」で、Chromeの「Touch to Search」機能の活用法を4つ紹介している。",
      "url": "https://k-tai.watch.impress.co.jp/docs/news/1431313.html",
      "urlToImage": "https://k-tai.watch.impress.co.jp/img/ktw/list/1431/313/Touch_to_Search.png",
      "publishedAt": "2022-08-11T21:00:00Z",
      "content": "GoogleThe KeywordChromeTouch to Search4 \r\n Touch to Search \r\nGet faster translations\r\n Chrome \r\nGet helpful info in context\r\n Touch to Search \r\nTap or hold down to get results\r\n Touch to Search \r\nUse… [+125 chars]"
    },
    {
      "source": { "id": null, "name": "ReadWrite" },
      "author": "Brad Anderson",
      "title": "How Tech Is Transforming the College Search",
      "description": "In the past, anyone interested in attending a college had a challenging time ahead of them. First, they needed to fill out paper application forms. High schoolers had to physically visit campuses, which naturally restricted the number of colleges they could c…",
      "url": "https://readwrite.com/tech-transforming-college-search/",
      "urlToImage": "https://images.readwrite.com/wp-content/uploads/2022/08/tech-transforming-college-search.jpg",
      "publishedAt": "2022-08-29T15:00:19Z",
      "content": "In the past, anyone interested in attending a college had a challenging time ahead of them. First, they needed to fill out paper application forms. High schoolers had to physically visit campuses, wh… [+6369 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Land" },
      "author": "RankZ",
      "title": "The 10 best SEO companies across the globe",
      "description": "Bringing in the best SEO company with the latest trending SEO services for your website is crucial to your success.\nThe post The 10 best SEO companies across the globe appeared first on Search Engine Land.",
      "url": "https://searchengineland.com/the-10-best-seo-agencies-across-the-globe-386864",
      "urlToImage": "https://searchengineland.com/wp-content/seloads/2022/08/Best-SEO-Companies.jpg",
      "publishedAt": "2022-08-05T11:00:00Z",
      "content": "Search Engine Optimization is no longer a do-it-yourself project unless you have a solid decade or so handling digital marketing and the latest Google algorithm changes.  Making websites and web page… [+28531 chars]"
    },
    {
      "source": { "id": null, "name": "Nature.com" },
      "author": "Bec Crew",
      "title": "The nanoscience revolution",
      "description": "Breakthroughs in nanotechnology could offer wide-ranging benefits to a host of industries, from agriculture to computing, but getting public buy-in remains key.",
      "url": "https://www.nature.com/articles/d41586-022-02146-4",
      "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-02146-4/d41586-022-02146-4_23345618.jpg",
      "publishedAt": "2022-08-10T00:00:00Z",
      "content": "Credit: Olemedia/Getty\r\nIn March, researchers at the University of Cambridge, UK, described building high-rise nano-housing for photosynthetic bacteria, designed to help the bacteria grow faster by p… [+1651 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Kristi Hines",
      "title": "16 Best Readability Checkers To Improve SEO Content via @sejournal, @kristileilani",
      "description": "Use these tools to help you punch up your copy and accurately convey information, all of which will reap benefits for SEO as well.\nThe post 16 Best Readability Checkers To Improve SEO Content appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/readability-checkers/460577/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/08/readability-1600-x-840-62f344c44fc7b-sej.png",
      "publishedAt": "2022-08-31T11:45:38Z",
      "content": "Have you ever tried to read something only to be put off by its difficulty? It happens to everyone, even the best educated and well-read people.\r\nPersonally, I’ve tried to tackle “Moby-Dick” on three… [+13075 chars]"
    },
    {
      "source": { "id": null, "name": "Cult of Mac" },
      "author": "Cult of Mac Deals",
      "title": "Boost your SEO with LongTailPro’s advanced keyword research",
      "description": "It’s not easy getting noticed on the internet. With so much competition on most search engines, ranking high enough to make it to the first page takes a ton of work and research. However, it’s easier if you use the right SEO tools. LongTailPro is an intellige…",
      "url": "https://www.cultofmac.com/788058/longtailpro-seo-keyword-research-tool/",
      "urlToImage": "https://www.cultofmac.com/wp-content/uploads/2022/08/CoM-LongTail-Pro.jpeg",
      "publishedAt": "2022-08-24T21:00:10Z",
      "content": "Its not easy getting noticed on the internet. With so much competition on most search engines, ranking high enough to make it to the first page takes a ton of work and research. However, its easier i… [+1663 chars]"
    },
    {
      "source": { "id": null, "name": "Springwise.com" },
      "author": "Katrina Lane",
      "title": "Social media tools help the public assess viral posts",
      "description": "The aim is to give journalists, researchers and the public a more varied, and more objective view of social media\nThe post Social media tools help the public assess viral posts appeared first on Springwise.",
      "url": "https://www.springwise.com/innovation/media-publishing/social-media-tools-help-the-public-assess-viral-posts",
      "urlToImage": "https://www.springwise.com/wp-content/uploads/2022/08/innovation_media-publishing_social-media-tools-help-the-public-assess-viral-posts.png",
      "publishedAt": "2022-08-23T04:55:00Z",
      "content": "Spotted:  In recent years, there has been a huge proliferation of information and communication online. This increase in the availability of information has created what Thomas Hills, a psychology pr… [+2254 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Kristopher Jones",
      "title": "5 Ways High-Quality Content & PPC Compliment Each Other via @sejournal, @krisjonescom",
      "description": "Content and PPC complement each other in more than just one way. Learn helpful tips on using your content and PPC campaigns in tandem!\nThe post 5 Ways High-Quality Content & PPC Compliment Each Other appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/content-marketing-ppc/456049/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/06/content-ppc-1600-x-840-62ea32dde04b8-sej.png",
      "publishedAt": "2022-08-18T11:45:35Z",
      "content": "In digital marketing, it’s so easy (and tempting) to separate the various sub-disciplines into their little worlds.\r\nHere’s SEO over here, the big one.\r\nThen there’s social media marketing, and over … [+8350 chars]"
    },
    {
      "source": { "id": null, "name": "Impress.co.jp" },
      "author": null,
      "title": "Fitbitの新製品「Inspire 3」「Versa 4」「Sense 2」発表",
      "description": "Fitbitの新製品として、「Inspire 3」「Versa 4」「Sense 2」が発表された。米グーグル（Google）は、同社の公式ブログである「The Keyword」で、今秋発売予定の各製品を紹介している。",
      "url": "https://k-tai.watch.impress.co.jp/docs/news/1434682.html",
      "urlToImage": "https://k-tai.watch.impress.co.jp/img/ktw/list/1434/682/fitbit.jpg",
      "publishedAt": "2022-08-25T08:35:32Z",
      "content": "FitbitInspire 3Versa 4Sense 2GoogleThe Keyword \r\n Fitbit Premium6Fitbit PremiumDaily Readiness ScoreSleep Profile"
    },
    {
      "source": { "id": null, "name": "Practical Ecommerce" },
      "author": "Ann Smarty",
      "title": "SEO: How to Assess Keyword Difficulty",
      "description": "Optimizing for keywords can improve a page's organic rankings. But the competition for keywords varies. Here's how to tell which ones are worth the effort.\nThe post SEO: How to Assess Keyword Difficulty appeared first on Practical Ecommerce.",
      "url": "https://www.practicalecommerce.com/seo-how-to-assess-keyword-difficulty",
      "urlToImage": "https://www.practicalecommerce.com/wp-content/uploads/2022/08/SEO-How-to-Assess-Keyword-Difficulty.jpg",
      "publishedAt": "2022-08-18T12:58:34Z",
      "content": "Identifying keywords for organic search rankings is easier now than a decade ago owing to advanced tools. A key factor in choosing a keyword is competition the number and quality of sites already ran… [+3500 chars]"
    },
    {
      "source": { "id": null, "name": "Practical Ecommerce" },
      "author": "Ann Smarty",
      "title": "SEO: Keyword Research for a New Site",
      "description": "A new site has no history of search queries that drive traffic and sales. But it can still research and optimize keywords. Here's how.\nThe post SEO: Keyword Research for a New Site appeared first on Practical Ecommerce.",
      "url": "https://www.practicalecommerce.com/seo-keyword-research-for-a-new-site",
      "urlToImage": "https://www.practicalecommerce.com/wp-content/uploads/2022/08/SEO-Keyword-Research-for-a-New-Site.jpg",
      "publishedAt": "2022-08-23T19:57:08Z",
      "content": "An established website has many options to expand keyword lists and identify organic search opportunities.\r\nBut what if a site is new? How can it identify keywords without data? Certainly the owner w… [+3226 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Bea Canuel",
      "title": "Synergy In Search: Insights From Rank Ranger CEO Shay Harel via @sejournal, @beacarlota17",
      "description": "What makes working in SEO exciting? For many, it’s about weighing in on Google’s crucial ranking factors or cracking open the mysteries of search algorithms. For some, it may be about helping businesses grow and prosper in the digital age. But for Shay Harel,…",
      "url": "https://www.searchenginejournal.com/synergy-in-search/453719/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/06/shay-harel-interview-62a348815a487-sej.png",
      "publishedAt": "2022-08-15T13:45:48Z",
      "content": "What makes working in SEO exciting?\r\nFor many, it’s about weighing in on Google’s crucial ranking factors or cracking open the mysteries of search algorithms.\r\nFor some, it may be about helping busin… [+5043 chars]"
    },
    {
      "source": { "id": null, "name": "Github.com" },
      "author": "elonlit",
      "title": "Genesis: God’s Actual Programming Language",
      "description": "God's actual programming language. Contribute to elonlit/Genesis development by creating an account on GitHub.",
      "url": "https://github.com/elonlit/Genesis",
      "urlToImage": "https://opengraph.githubassets.com/130c78cfff589d69dc637b2a580e338bd6f0c6a9e46f4763e60f47c46073af53/elonlit/Genesis",
      "publishedAt": "2022-08-07T00:02:42Z",
      "content": "\"My frame was not hidden from you, when I was being made in secret, intricately woven in the depths of the earth. Your eyes saw my unformed substance; in your book were written, every one of them, th… [+9032 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Brian Frederick",
      "title": "Google’s Ad Market Subject Of Upcoming Antitrust Suit. Again. via @sejournal, @BrianFr07823616",
      "description": "Google is yet again under fire from for its alleged anticompetitive practices in online advertising.  According to Bloomberg, the U.S. Department of Justice could sue Alphabet, Inc, the search engine’s parent company, for antitrust violations as early as next…",
      "url": "https://www.searchenginejournal.com/googles-ad-market-subject-of-upcoming-antitrust-suit-again/461866/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/08/shutterstock_1875389428-62ff47f0a6d79-sej.jpg",
      "publishedAt": "2022-08-19T08:23:15Z",
      "content": "Google is yet again under fire from for its alleged anticompetitive practices in online advertising. \r\nAccording to Bloomberg, the U.S. Department of Justice could sue Alphabet, Inc, the search engin… [+2116 chars]"
    },
    {
      "source": { "id": null, "name": "Lightroomkillertips.com" },
      "author": "Rob Sylvan",
      "title": "Finding People in Lightroom (cloud) Part 2",
      "description": "Let’s wrap up my post from last week on using face recognition in Lightroom. If you should ever find a photo of a person within a face group who is not the right person for that face group (or if it is a photo you don’t want assigned that person’s name), you …",
      "url": "https://lightroomkillertips.com/finding-people-in-lightroom-cloud-part-2/",
      "urlToImage": "https://lightroomkillertips.com/wp-content/uploads/2022/08/lrpeople-11.jpg",
      "publishedAt": "2022-08-31T11:35:00Z",
      "content": "Let’s wrap up my post from last week on using face recognition in Lightroom. If you should ever find a photo of a person within a face group who is not the right person for that face group (or if it … [+2789 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Alex Macura",
      "title": "13 Local Marketing Strategies That Work In 2022 via @sejournal, @macuraa",
      "description": "From creating a Google Business Profile to gaining more customer reviews, here are 13 tips to update your local marketing strategies and reinforce your brand.\nThe post 13 Local Marketing Strategies That Work In 2022 appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/local-marketing-strategies/461540/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/08/local-marketing-2022-62fcf6ea1cafc-sej.png",
      "publishedAt": "2022-08-26T13:45:51Z",
      "content": "You can reach valuable leads through local online and offline marketing.\r\nYou must develop effective local marketing strategies to build your brand authority and attract more customers.\r\nA digital ma… [+14053 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Miranda Miller",
      "title": "How Can We Improve Rankings For Older Content? Ask An SEO via @sejournal, @mirandalmwrites",
      "description": "A reader asks Adam Riemer for help improving the Google Search rankings of existing content in this Ask An SEO (with video).\nThe post How Can We Improve Rankings For Older Content? Ask An SEO appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/improve-old-content-rankings/457728/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/07/askanseo_adamr_2-62ea42b9854f5-sej.png",
      "publishedAt": "2022-08-16T13:45:46Z",
      "content": "How can you help existing webpages get new traction and move up in search rankings?\r\nThat’s the question posed by Faith in this edition of Ask An SEO. She wrote:\r\n“I have a few keywords ranking on th… [+13292 chars]"
    },
    {
      "source": { "id": null, "name": "Forbes" },
      "author": "Expert Panel®, Forbes Councils Member, \n Expert Panel®, Forbes Councils Member\n https://www.forbes.com/sites/forbesagencycouncil/people/expertpanel/",
      "title": "15 Smart Ways To Integrate SEO And PPC Marketing Strategies",
      "description": "While they may seem entirely distinct at first glance, SEO and PPC marketing can actually complement each other, offering more robust insights when integrated than when operating separately.",
      "url": "https://www.forbes.com/sites/forbesagencycouncil/2022/08/22/15-smart-ways-to-integrate-seo-and-ppc-marketing-strategies/",
      "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/62ffe1dac6e9721d615f25ec/0x0.jpg?format=jpg&width=1200",
      "publishedAt": "2022-08-22T17:15:00Z",
      "content": "Many marketing strategies employ both search engine optimization and pay-per-click tactics. While they may seem entirely distinct at first glance, SEO and PPC marketing can actually complement each o… [+6665 chars]"
    },
    {
      "source": { "id": null, "name": "Impress.co.jp" },
      "author": null,
      "title": "グーグルの“中の人”が紹介する、「Chrome」の便利な使い方とは",
      "description": "グーグル（Google）は、開発チームのメンバーが「Chrome」ブラウザの便利な機能や使い方を紹介するエントリーを、公式ブログ「The Keyword」に投稿した。2022年にChromeが100回目のアップデートを迎えたことを受けて企画されたもの。",
      "url": "https://k-tai.watch.impress.co.jp/docs/news/1433344.html",
      "urlToImage": "https://k-tai.watch.impress.co.jp/img/ktw/list/1433/344/100.png",
      "publishedAt": "2022-08-21T21:00:00Z",
      "content": "GoogleChromeThe Keyword2022Chrome100"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Jessica Foster",
      "title": "7 Tips To Make Your Writing Portfolio Discoverable In Google Search via @sejournal, @seocopychick",
      "description": "Get more clients for your writing services by investing in SEO. Here's how to drive organic traffic to your portfolio, as well as active clients.\nThe post 7 Tips To Make Your Writing Portfolio Discoverable In Google Search appeared first on Search Engine Jour…",
      "url": "https://www.searchenginejournal.com/optimize-writing-portfolio-seo/458527/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/08/writing-portfolio-discoverable-62ed8376de04d-sej.png",
      "publishedAt": "2022-08-08T12:45:38Z",
      "content": "I’ve always been a writer.\r\nSince I learned to put pencil to paper, I’ve been writing stories, poems, plays, and anything else that put my imagination into words.\r\nWhen I discovered blogging, I quick… [+9780 chars]"
    },
    {
      "source": { "id": null, "name": "Jebraat.com" },
      "author": "Jonathan Braat",
      "title": "Dealing with the Perfectionism Trap as a Developer",
      "description": "When developing software or even building a SaaS business over-planning and over-engineering can stifle your progress. Learn how to battle your perfectionism.",
      "url": "https://jebraat.com/blog/dealing-with-the-perfectionism-trap-as-a-developer",
      "urlToImage": "https://img.spryse.com/?t=Dealing%20With%20the%20Perfectionism%20Trap%20as%20a%20Developer",
      "publishedAt": "2022-08-31T20:42:47Z",
      "content": "When developing software or even building a SaaS business over-planning and over-engineering can stifle your progress. Learn how to battle your perfectionism.\r\nWhat is perfectionism\r\nPerfectionism is… [+5493 chars]"
    },
    {
      "source": { "id": null, "name": "Osxdaily.com" },
      "author": "Hamlin Rozario",
      "title": "How to Search Messages on Mac",
      "description": "If you use Messages app on your Mac, you may frequently arrive at a situation where you’d like to search and filter the content of your messages and conversations for a match, or a particular word, or topic. Fortunately, the Messages for Mac app has a nice an…",
      "url": "https://osxdaily.com/2022/08/31/how-to-search-messages-on-mac/",
      "urlToImage": "https://cdn.osxdaily.com/wp-content/uploads/2021/05/how-to-search-messages-on-mac.jpg",
      "publishedAt": "2022-08-31T15:10:22Z",
      "content": "If you use Messages app on your Mac, you may frequently arrive at a situation where you’d like to search and filter the content of your messages and conversations for a match, or a particular word, o… [+2744 chars]"
    },
    {
      "source": { "id": null, "name": "Cracked.com" },
      "author": "Carolyn Page",
      "title": "Cracked Exclusive: A New Mythic Commander From Dominaria United, The Latest Magic: The Gathering Set",
      "description": "Meet a hero of Dominaria... and your new favorite Commander.",
      "url": "https://www.cracked.com/article_35043_cracked-exclusive-a-new-mythic-commander-from-dominaria-united-the-latest-magic-the-gathering-set.html",
      "urlToImage": "https://s3.crackedcdn.com/phpimages/article/0/0/0/865000.jpg",
      "publishedAt": "2022-08-19T17:00:00Z",
      "content": "Continue Reading Below \r\nThe character first appeared as a major player in 2018's Dominaria set. Shanna joined Captain Jhoira, serving as a crew member of the storied skyship The Weatherlight. She fi… [+1971 chars]"
    },
    {
      "source": { "id": null, "name": "A Beautiful Mess" },
      "author": "Elsie Larson",
      "title": "Sheet Pan Totchos",
      "description": "Totchos (tater tot nachos) an ultimate extremely easy sheet pan meal. In this post, we'll teach you our favorite lunch or dinnertime version.",
      "url": "https://abeautifulmess.com/sheet-pan-totchos/",
      "urlToImage": "http://abeautifulmess.com/wp-content/uploads/2022/08/Sheet-pan-loaded-totchos.jpg",
      "publishedAt": "2022-08-16T13:00:00Z",
      "content": "Totchos are tater tot nachos. They are an ultimate extremely easy family meal. In this post, we’ll teach you our favorite lunch or dinnertime version. \r\nThey are simple to make, great for a group, an… [+3052 chars]"
    },
    {
      "source": { "id": null, "name": "A Beautiful Mess" },
      "author": "Emma Chapman",
      "title": "Vodka Martini Recipe (3 Ways!)",
      "description": "A vodka martini is a super simple cocktail, but there are a number of small variations that can really impact the final drink.",
      "url": "https://abeautifulmess.com/how-to-make-a-vodka-martini/",
      "urlToImage": "http://abeautifulmess.com/wp-content/uploads/2019/02/vodka-martini.jpg",
      "publishedAt": "2022-08-17T13:00:00Z",
      "content": "A vodka martini is a super simple cocktail. It only has two ingredients, but because it is so simple, there are a number of small variations that can really impact the final drink.\r\nPersonally, I lov… [+2366 chars]"
    },
    {
      "source": { "id": null, "name": "Ppchero.com" },
      "author": "nikolasekulic",
      "title": "Keyword and Landing Page Expansion: Tips to Boost Your PPC Campaigns in 2022",
      "description": "Digital marketing and advertising are always evolving with the new online trends, customer behavior, and industry demands. That means that marketing and advertising strategies should never be set in stone, rather, you should always make sure that your strateg…",
      "url": "https://www.ppchero.com/keyword-and-landing-page-expansion-tips-to-boost-your-ppc-campaigns-in-2022/",
      "urlToImage": "https://www.ppchero.com/wp-content/uploads/2022/08/HeroBlog-KeywordandLandingPageExpansion-SM-Graphic.png",
      "publishedAt": "2022-08-10T12:15:00Z",
      "content": "Digital marketing and advertising are always evolving with the new online trends, customer behavior, and industry demands. That means that marketing and advertising strategies should never be set in … [+6138 chars]"
    },
    {
      "source": { "id": null, "name": "Forbes" },
      "author": "John Hall, Senior Contributor, \n John Hall, Senior Contributor\n https://www.forbes.com/sites/johnhall/",
      "title": "3 Tips To Create Google Ads Better Than Your Competitors",
      "description": "Strategic keyword differentiation can provide an initial boost that helps your Google Ads rise above the noise. However, backing up those clicks with customer-focused website experiences and content will validate your company’s messaging and help you garner l…",
      "url": "https://www.forbes.com/sites/johnhall/2022/08/07/3-tips-to-create-google-ads-better-than-your-competitors/",
      "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/62e19b46b642cb2daf133858/0x0.jpg?format=jpg&crop=1810,1357,x6,y0,safe&width=1200",
      "publishedAt": "2022-08-07T12:00:00Z",
      "content": "Close-up of person typing on laptop\r\ngetty\r\nWeve all been guilty of using Google to search mundane questions, like How many ounces are in a pound? or Can I use bacon grease as oil? However, Google ha… [+4790 chars]"
    },
    {
      "source": { "id": null, "name": "Techopedia" },
      "author": "Vaibhav Kakkar",
      "title": "Local SEO: Why Does it Matter for My Business? - Techopedia",
      "description": "<p>Local SEO helps increase your business' visibility in search results from your local area. Consistent citations, local keyword targeting, localized content and backlinks, local business directories, positive reviews and social media can help you find custo…",
      "url": "http://www.techopedia.com/local-seo-why-does-it-matter-for-my-business/2/34846/#article",
      "urlToImage": "https://images.techopedia.com/images/uploads/local-seo.jpg",
      "publishedAt": "2022-09-05T00:13:36Z",
      "content": "Today's market is extremely competitive.\r\nThe first benchmark many SMBs set for themselves is going national; ever-changing algorithms can make digital marketing more challenging than one might antic… [+10527 chars]"
    },
    {
      "source": { "id": null, "name": "Forbes" },
      "author": "David Prosser, Contributor, \n David Prosser, Contributor\n https://www.forbes.com/sites/davidprosser/",
      "title": "Scalenut Raises $3.1m For Automated Content Creation Platform",
      "description": "Scalenut helps creators develop content more quickly as businesses seek to scale their brand",
      "url": "https://www.forbes.com/sites/davidprosser/2022/08/23/scalenut-raises-31m-for-automated-content-creation-platform/",
      "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/62fe39d0424fd014ed5f25e6/0x0.jpg?format=jpg&crop=2400,1125,x0,y275,safe&width=1200",
      "publishedAt": "2022-08-23T06:00:00Z",
      "content": "How do companies build their brands as they seek to scale? The choice is between paying for exposure or developing their own content in order to attract and engage potential customers. The second opt… [+4868 chars]"
    },
    {
      "source": { "id": null, "name": "Android Police" },
      "author": "Abubakar Mohammed",
      "title": "How to add audio to Google Slides",
      "description": "Google Slides is an incredible alternative to Microsoft PowerPoint. It offers everything you'd expect and you can even add audio to your presentation.",
      "url": "https://www.androidpolice.com/how-to-add-audio-google-slides/",
      "urlToImage": "https://static1.anpoimages.com/wordpress/wp-content/uploads/2021/10/google-slides-hero.jpg",
      "publishedAt": "2022-08-16T13:00:14Z",
      "content": "Google Slides provides an easy way to make and save presentations on the cloud so that you can access them from anywhere in the world. It’s a part of Google Workspace, a feature-rich, cloud-based off… [+4865 chars]"
    },
    {
      "source": { "id": null, "name": "Nature.com" },
      "author": null,
      "title": "A guide to the Nature Index",
      "description": "A description of the terminology and methodology used in this supplement, and a guide to the functionality that is available free online at natureindex.com.",
      "url": "https://www.nature.com/articles/d41586-022-02152-6",
      "urlToImage": null,
      "publishedAt": "2022-08-10T00:00:00Z",
      "content": "The Nature Index is a database of author affiliations and institutional relationships. The index tracks contributions to research articles published in 82 high-quality natural-science journals, chose… [+3837 chars]"
    },
    {
      "source": { "id": null, "name": "Github.com" },
      "author": "jesseduffield",
      "title": "The OK? Programming Language",
      "description": "Welcome to the future of programming languages: OK? - GitHub - jesseduffield/OK: Welcome to the future of programming languages: OK?",
      "url": "https://github.com/jesseduffield/OK",
      "urlToImage": "https://opengraph.githubassets.com/8e99b28731fd751953afd6d09c585f9d9e5d816887b1dbf908d69919eedb00a0/jesseduffield/OK",
      "publishedAt": "2022-08-29T17:26:22Z",
      "content": "Try it out on the playground\r\nWatch the Making-of video\r\nOK?'s mascot: Quentyn Questionmark.\r\nOK? is a modern, dynamically typed programming language with a vision for the future.\r\nOK?'s mission is t… [+15473 chars]"
    },
    {
      "source": { "id": null, "name": "Forbes" },
      "author": "Douglas Karr, CommunityVoice, \n Douglas Karr, CommunityVoice\n https://www.forbes.com/sites/forbesagencycouncil/people/douglaskarr1/",
      "title": "Don’t Let SEO Platforms Dictate Your Search Strategy",
      "description": "Search engine marketing platforms provide amazing reports on virtually every digital characteristic of your site, but what about the useful visitor insights you’re searching for?",
      "url": "https://www.forbes.com/sites/forbesagencycouncil/2022/08/23/dont-let-seo-platforms-dictate-your-search-strategy/",
      "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/63038709a181af60a8f3e7f3/0x0.jpg?format=jpg&width=1200",
      "publishedAt": "2022-08-23T11:15:00Z",
      "content": "Recognized leader in digital transformation, partner at Highbridge, founder of Martech Zone, public speaker, author, podcaster &amp; consultant.\r\ngetty\r\nIncreasing overall business results can start … [+5689 chars]"
    },
    {
      "source": { "id": null, "name": "Small Business Trends" },
      "author": "Yednekachew Samson",
      "title": "Online Business Courses Entrepreneurs Should Consider",
      "description": "With so many skills and technologies available for students, here are some online business courses entrepreneurs should consider.",
      "url": "https://smallbiztrends.com/2022/08/online-business-courses.html",
      "urlToImage": "https://media.smallbiztrends.com/2022/07/online-business-courses.png",
      "publishedAt": "2022-08-18T14:30:15Z",
      "content": "If you buy something through our links, we may earn money from our affiliate partners. Learn more.\r\nStarting a business brings with it great opportunities as well as challenges. Capitalizing on these… [+6850 chars]"
    },
    {
      "source": { "id": null, "name": "Chsxf.dev" },
      "author": "Christophe SAUVEUR",
      "title": "I Quit Using SwiftUI",
      "description": "SwiftUI is currently the new trend in the Apple development world. And I wanted to give it a try. I did. However, in this post, I explain why I went back to AppKit for The Untitled Project’s authoring tools.",
      "url": "https://chsxf.dev/2022/08/28/5-tup-why-i-quit-using-swiftui.html",
      "urlToImage": "https://chsxf.dev/assets/posts/5/map-editor-with-inspector.png",
      "publishedAt": "2022-08-28T17:53:54Z",
      "content": "28 August 2022Why I Quit Using SwiftUI\r\nAs CiderKit, the authoring tools for The Untitled Project, starts taking shape and becomes more complex, I needed to create windows and UI elements for various… [+6339 chars]"
    },
    {
      "source": { "id": null, "name": "Github.com" },
      "author": "jart",
      "title": "Cosmopolitan Libc v2.0",
      "description": "Cosmopolitan Libc makes C a build-once run-anywhere language, like Java, except it doesn't need an interpreter or virtual machine. Instead, it reconfigures stock GCC to output a POSIX-approved poly...",
      "url": "https://github.com/jart/cosmopolitan/releases/tag/2.0",
      "urlToImage": "https://opengraph.githubassets.com/6edf4308ff338cfcba67c45c6d6d1a0c807e3b6a192325cdf8c3242da7da186c/jart/cosmopolitan/releases/tag/2.0",
      "publishedAt": "2022-08-20T05:55:55Z",
      "content": "Cosmopolitan Libc makes C a build-once run-anywhere language, like Java, except it doesn't need an interpreter or virtual machine. Instead, it reconfigures stock GCC to output a POSIX-approved polygl… [+7402 chars]"
    },
    {
      "source": { "id": null, "name": "Cppstories.com" },
      "author": "",
      "title": "Curious C++ Lambda Examples: Recursion, constexpr, Containers C++23 included",
      "description": "In this blog post I’ll show you a couple of interesting examples with lambda expressions. Do you know how to write a recursive lambda? Store them in a container? Or invoke at compile time?\nSee in the article.\nUpdated in August 2022: Added C++23 improvements.\n…",
      "url": "https://www.cppstories.com/2020/07/lambdas5ex.html/",
      "urlToImage": "https://www.cppstories.com/2020/images/lambdas5ex.png",
      "publishedAt": "2022-08-10T17:58:18Z",
      "content": "Table of Contents\r\nIn this blog post I’ll show you a couple of interesting examples with lambda expressions. Do you know how to write a recursive lambda? Store them in a container? Or invoke at compi… [+6869 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Brian Harnish",
      "title": "A Complete Guide To Site Taxonomy for SEO via @sejournal, @BrianHarnish",
      "description": "Future-proof your site by applying the best practices for site taxonomy. Provide the correct silos for your content with this comprehensive guide.\nThe post A Complete Guide To Site Taxonomy for SEO appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/complete-guide-site-taxonomy-seo/461241/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/08/site-taxonomy-62fa52a264540-sej.png",
      "publishedAt": "2022-08-25T12:45:27Z",
      "content": "For those who have been in SEO for some time, you may have heard of site taxonomy as it refers to the website.\r\nWhen you refer to a website’s structure and how easy it is for users to navigate, you a… [+18811 chars]"
    },
    {
      "source": { "id": "hacker-news", "name": "Hacker News" },
      "author": null,
      "title": "Launch HN: Boostly (YC S22) – SMS marketing for restaurants",
      "description": "Comments",
      "url": "https://news.ycombinator.com/item?id=32675658",
      "urlToImage": null,
      "publishedAt": "2022-09-01T13:00:03Z",
      "content": "Hey HN, we are Shane and Mikey, the co-founders of Boostly (https://boostly.com). Boostly is a text marketing and feedback system for restaurants that works seamlessly with their point of sale, onlin… [+7127 chars]"
    },
    {
      "source": { "id": null, "name": "Practical Ecommerce" },
      "author": "Matthew Umbro",
      "title": "4 Google Ads Tactics Worth Preserving",
      "description": "It's easy to forget the tried and true methods for Google Ads set-up. Here are four once-popular practices that still hold value today. \nThe post 4 Google Ads Tactics Worth Preserving appeared first on Practical Ecommerce.",
      "url": "https://www.practicalecommerce.com/4-google-ads-tactics-worth-preserving",
      "urlToImage": "https://www.practicalecommerce.com/wp-content/uploads/2022/09/PPC-Tactics.jpg",
      "publishedAt": "2022-09-04T11:59:31Z",
      "content": "The pay-per-click ad industry is always evolving. New features roll out nonstop managing a campaign a year ago is likely different today.\r\nBut some Google Ads tactics remain useful, even if seemingly… [+3601 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Elizabeth Marsten",
      "title": "How To Use Amazon Hidden Keywords To Increase Product Discoverability via @sejournal, @ebkendo",
      "description": "Let's take an in-depth look at Amazon’s hidden keywords and learn everything you need to know to put them to work for your Amazon store.\nThe post How To Use Amazon Hidden Keywords To Increase Product Discoverability appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/how-to-use-amazon-keywords/459103/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/07/hidden-keywords-1600-x-840-62e12e1fc678a-sej.png",
      "publishedAt": "2022-08-24T11:45:49Z",
      "content": "Amazon is the biggest name in the game for selling products online. But with 1.9 million selling partners, the competition is fierce.\r\nTo claim your market share, you need to show up in the searches … [+9164 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Josh McCoy",
      "title": "When To Canonicalize, Noindex, Or Do Nothing With Similar Content via @sejournal, @joshuacmccoy",
      "description": "The canonical and meta robots noindex tags are a great way to preserve website functionality for all users while also instructing search engines.\nThe post When To Canonicalize, Noindex, Or Do Nothing With Similar Content appeared first on Search Engine Journa…",
      "url": "https://www.searchenginejournal.com/addressing-similar-content-when-to-canonicalize-when-to-noindex-when-to-do-nothing/199057/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/06/similar-content-1600-x-840-62df60ea47f6e-sej.png",
      "publishedAt": "2022-08-24T23:46:06Z",
      "content": "Picture your content as you do yourself. Are you carrying some baggage you could get rid of? Carrying something you want to keep but maybe want to repurpose or see differently?\r\nThis is no different … [+9615 chars]"
    },
    {
      "source": { "id": null, "name": "Search Engine Journal" },
      "author": "Loren Baker",
      "title": "What Is Topical Authority & How Does It Work via @sejournal, @lorenbaker",
      "description": "Knowing when to use topical authority will help you rank higher than your competitors. Let's dig into everything you need to know about topical authority.\nThe post What Is Topical Authority & How Does It Work appeared first on Search Engine Journal.",
      "url": "https://www.searchenginejournal.com/what-is-topical-authority/457893/",
      "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/07/topical-authority-1600-x-840-62d55dd103952-sej.png",
      "publishedAt": "2022-08-11T11:45:22Z",
      "content": "You’ve probably heard the term “authority” thrown around a lot when it comes to search engine optimization (SEO).\r\nBut what does it mean exactly? And if you already know what it is, then you may be t… [+10903 chars]"
    }
  ]
}
